Courses/7370/Lectures/Classics/classics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Classic Problems in Concurrency</title>
<!-- 2016-09-05 Mon 11:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2015-03-13 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Classic Problems in Concurrency</h1>
<p>
Every student of distributed computing should know quite a bit about
the fundamentals of concurrency.  A good chunk of that is knowing why
the following problems (not necessarily their solutions) are worthy of
study.
</p>

<p>
The classic problems mentioned below are well defined; so do a web
search.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://en.wikipedia.org/wiki/Dining_philosophers_problem">Dining Philosophers Problem</a></h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Illustrates deadlock
</li>
<li>Illustrates livelock
</li>
<li>Illustrates malicious cooperation
</li>
<li>Assume or not: Communication among them
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://en.wikipedia.org/wiki/Mutual_exclusion">Mutual Exclusion Problem</a></h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Consider two or more processes.  Each P<sub>i</sub> has an area of code
C<sub>i</sub> "sensitive enough" that we call it a "critical section" CS.
</li>
<li>Assume CS always terminates.
</li>
<li>"Sensitive enough" == shared variable, usually
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Mutual Exclusion Problem</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Find a solution that satisfies four requirements:
<ol class="org-ol">
<li>R1 Mutual Exclusion: Number of processes in the CS, at any time
== 0 or 1.
</li>
<li>R2: Deadlock-Free + Live-lock-free
</li>
<li>R3: No Unnecessary Delay
</li>
<li>R4: Eventual Entry or Bounded Waiting: A process wishing to enter its CS, must be
able to enter it in a finite amount of wait.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Mutual Exclusion Problem</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Typically solved with semaphores.  
<ol class="org-ol">
<li>m : semaphore := 1
</li>
<li>Entry to CS: P(m);
</li>
<li>Exit from CS: V(m);
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Mutual Exclusion Problem</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Also, read about solutions such as Dekker's and Peterson's,
using ordinary variables.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Mutual Exclusion Problem</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Two processes can illustrate the essence of the issue, but we
are also interested in "starvation-free" semaphore based
solutions, especially in distributed systems.
<ol class="org-ol">
<li>The above solution is not starvation free.
</li>
</ol>
</li>

<li>Starvation-free Mutex Solutions Using Split Binary Semaphores
<ol class="org-ol">
<li>.<a href="./Semaphores/udding-morris-algs.html">./Semaphores/udding-morris-algs.html</a>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://en.wikipedia.org/wiki/Readers%E2%80%93writers_problem">Readers-Writers Problem</a></h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Read-Sharing a resource
</li>
<li>Exclusive update of the resource
</li>
<li>Andrews' <a href="./passing-the-baton-ns.html">Notes on Passing The Baton Technique</a>
</li>
<li><a href="./Parnas-readers-writers-with-priority.html">Parnas readers-writers</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Producers-Consumers Problem</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>aka Bounded Buffer Problem
</li>
<li><a href="https://en.wikipedia.org/wiki/Producer%E2%80%93consumer_problem">Producers-Consumers Problem</a>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Cigarette Smokers Problem</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>What problems of concurrency can semaphores solve?
</li>
<li>Introduces an array of semaphores.
</li>
<li>Cigarette Smokers Problem cannot be solved without arrays.
</li>
<li><a href="https://en.wikipedia.org/wiki/Cigarette_smokers_problem">Cigarette Smokers Problem</a>
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://en.wikipedia.org/wiki/Dining_cryptographers_problem">Dining Cryptographers Problem</a></h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://en.wikipedia.org/wiki/Sleeping_barber_problem">Sleeping Barber Problem</a></h2>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> End</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2015-03-13
</div>
</body>
</html>
